Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This function returns the text from a single part of the status bar control.
ja: この関数は、ステータスバーコントロールの単一部分のテキストを返す。

source: This function returns the text of line N in an Edit control.
ja: 説明： Edit コントロールのN行目のテキストを返します。

source: This function returns the text of the specified control.
ja: 説明： 指定されたコントロールのテキストを返します。

source: This function returns the text of the specified window.
ja: この関数は、指定されたウィンドウのテキストを返します。

source: This function returns the title of the specified window.
ja: この関数は、指定されたウィンドウのタイトルを返します。

source: This function returns the total capacity of the drive which contains Path, in megabytes.
ja: この関数は、指定されたパスを含むドライブの容量をメガバイト単位で返します。

source: This function returns the total capacity of the drive which contains the specified path, in megabytes.
ja: 説明： 指定されたパスを含むドライブの総容量をメガバイト単位で返す。

source: This function returns the total number of monitors.
ja: この関数は、モニターの総数を返します。

source: This function returns the transformed version of the specified timestamp.
ja: 説明： 指定されたタイムスタンプを変換したものを返す。

source: This function returns the type of Drive's file system.
ja: この関数は、Driveのファイルシステムの種類を返す。

source: This function returns the type of the drive which contains Path:
ja: この関数は、指定されたパスを含むドライブの種類を返します。

source: This function returns the type of the drive which contains Path: Unknown, Removable, Fixed, Network, CDROM, or RAMDisk.
ja: この関数は、指定されたPathを含むドライブの種類を返します：Unknown、Removable、Fixed、Network、CDROM、RAMDisk。

source: This function returns the type of the drive which contains the specified path:
ja: 説明： 指定されたパスを含むドライブの種類を返す：

source: This function returns the value of the specified environment variable.
ja: 説明： 指定された環境変数の値を返します。

source: This function returns the value of the specified system property.
ja: この関数は、指定されたシステム・プロパティの値を返す。

source: This function returns the version number of the specified file.
ja: 説明： 指定されたファイルのバージョン番号を返す。

source: This function returns the virtual key code of the specified key, or 0 if the key is invalid or has no virtual key code.
ja: 説明： 指定された鍵の仮想鍵コードを返し、その鍵が無効であるか仮想鍵コードがない場合は 0 を返す。

source: This function returns the volume label of the specified drive.
ja: 説明： 指定されたドライブのボリュームラベルを返します。

source: This function returns the volume serial number of the specified drive.
ja: 説明： 指定されたドライブのボリュームシリアル番号を返します。

source: This function returns true if BaseObj is in Value's chain of base objects, otherwise false.
ja: この関数は、BaseObjが Valueのベースオブジェクトの連鎖の中にあれば真を、そうでなければ偽を返す。

source: This function returns true if a method was found and passed validation (if performed), otherwise false.
ja: この関数は、メソッドが見つかり、バリデーション（実行された場合）に合格した場合は真を、そうでない場合は偽を返します。

source: This function returns true if the value has a property by this name, otherwise false.
ja: この関数は、値がこの名前のプロパティを持つ場合に真を、そうでない場合に偽を返します。

source: This function sends a close message to a window.
ja: この関数はウィンドウを閉じるメッセージを送信する。

source: This function should be used with caution because sending a message to the wrong window (or sending an invalid message) might cause unexpected behavior or even crash the target application.
ja: 誤ったウィンドウにメッセージを送信したり、無効なメッセージを送信したりすると、予期せぬ動作が発生したり、ターゲットアプリケーションがクラッシュしたりする可能性があるため、この関数は慎重に使用しなければなりません。

source: This function should correctly compare Semantic Versioning 2.0.0 version strings, but the parameters are not required to be valid SemVer strings.
ja: この関数はSemantic Versioning 2.0.0のバージョン文字列を正しく比較しますが、パラメータは有効なSemVer文字列である必要はありません。

source: This function supports primitive values.
ja: 本機能は、プリミティブな値をサポートします。

source: This function throws an exception if the parameters are invalid or a memory allocation fails.
ja: パラメータが不正な場合、またはメモリ確保に失敗した場合は、例外を投げます。

source: This function typically shouldn't be used to determine if a value is numeric, since numeric strings are valid in math expressions and with most built-in functions.
ja: 数値文字列は数式やほとんどの組み込み関数で有効なため、通常、この関数は値が数値かどうかを判断するために使われることはありません。

source: This function uses the sending method set by SendMode.
ja: SendModeで設定された送信方式を使用します。

source: This function waits for the ejection or retraction to complete before allowing the script to continue.
ja: この機能は、射出または後退が完了するのを待ってからスクリプトを続行させるものです。

source: This function will also create all parent directories given in DirName if they do not already exist.
ja: また、DirNameで指定された親ディレクトリがまだ存在しない場合は、すべて作成します。

source: This function will probably not work on a network drive or non-CD/DVD drive.
ja: この関数は、ネットワークドライブや非CD/DVDドライブではおそらく動作しません。

source: This function will probably not work on a network drive or non-CD/DVD drive; if it fails in such cases or for any other reason, an exception is thrown.
ja: この関数は、ネットワークドライブや非CD/DVDドライブではおそらく動作しません。このような場合、またはその他の理由で失敗した場合、例外がスローされます。

source: This gives What a clearer purpose:
ja: これにより、Whatは、より明確な目的を持つことができます：

source: This gives What a clearer purpose: a function name indicates a failure of that function (not a failure to call the function or evaluate its parameters).
ja: これにより、Whatは、より明確な目的を持つことができます：関数名の場合は、その関数の失敗を示します（関数の呼び出しやパラメータの評価に失敗したわけではありません）。

source: This gives the thread a chance to finish rather than being immediately interrupted by another thread that is waiting to launch (such as a buffered hotkey or a series of timed subroutines that are all due to be run).
ja: これにより、起動待ちの他のスレッド（バッファリングされたホットキーや、すべての実行が予定されている一連の定時サブルーチンなど）に即座に割り込まれることなく、スレッドを終了させることができる。

source: This handling was slightly different between the two versions, and might need to be taken into account in very rare cases while reading v1.0 code.
ja: この処理は2つのバージョンで若干異なっており、v1.0のコードを読む際に非常に稀なケースで考慮する必要があるかもしれません。

source: This happens if the Loop performs zero iterations or if it never calls FileAppend.
ja: これは、Loopが0回の繰り返しを行うか、FileAppendを一度も呼び出さない場合に発生します。

source: This has advantage over A_IsCompiled because the code is completely removed from the compiled script during preprocessing, thus making the compiled script smaller.
ja: これはA_IsCompiledよりも利点がある。なぜなら、前処理中にコンパイルされたスクリプトからコードが完全に取り除かれるため、コンパイルされたスクリプトが小さくなるからだ。

source: This has an effect only for LV.Modify; for example:
ja: これはLV.Modifyにのみ効果があり、例えば以下のようなものがあります：

source: This has an effect only for LV.Modify; for example: LV.Modify(RowNumber, "Vis").
ja: これはLV.Modifyにのみ効果があり、例えば以下のようなものがあります：LV.Modify(RowNumber, "Vis")。

source: This has been confirmed to work on Windows 7 and Windows 11.
ja: Windows 7、Windows 11での動作が確認されています。

source: This has been disabled, to remove a possible impediment to the proper implementation of named parameters.
ja: これは、名前付きパラメータの適切な実装を妨げる可能性を排除するために、無効化されています。

source: This has been removed.
ja: これは削除されました。

source: This has no effect on other threads.
ja: これは他のスレッドには影響しない。

source: This has no effect when applied to a pure number, but can be used to convert numeric strings to pure numbers.
ja: これは純粋な数値に適用しても何の効果もないが、数値文字列を純粋な数値に変換するために使うことができる。

source: This has no effect when not in Report (Details) view.
ja: レポート（詳細）表示でない場合は、効果がありません。

source: This has not been confirmed, and might only be possible if the chosen bounds are larger than 2**53.
ja: これは確認されておらず、選ばれた境界が2**53より大きい場合にのみ可能かもしれません。

source: This has the advantage that Space and CapsLock perform their normal function if you are not holding Ctrl.
ja: これは、Ctrlを押していなければ、スペースとCapsLockが通常の機能を果たすという利点があります。

source: This has the effect of giving it precedence over any hooks previously installed by other processes.
ja: これは、他のプロセスによって以前にインストールされたフックよりも優先される効果があります。

source: This has the following implications:
ja: これには次のような意味があります：

source: This has the same effect as #SingleInstance Off.
ja: これは#SingleInstance Offと同じ効果を持つ。

source: This helps the script to behave consistently across multiple locales.
ja: これにより、スクリプトが複数のロケール間で一貫した動作をするようになります。

source: This helps to detect errors such as mispelled names and forgotten assignments.
ja: これにより、名前の間違いや課題の忘れ物などのミスを発見することができます。

source: This icon change can be avoided by freezing the icon, which is achieved by using TraySetIcon(,, true).
ja: このアイコンの変更は、TraySetIcon(,, true)を使ってアイコンをフリーズさせることで回避できる。

source: This improves performance and allows strings to contain binary zero.
ja: これにより、パフォーマンスが向上し、文字列が2進数の0を含むことができるようになります。

source: This improves performance and reduces the risk of problems when the script is busy/unresponsive.
ja: これにより、パフォーマンスが向上し、スクリプトがビジー／無反応の場合に問題が発生するリスクを低減することができます。

source: This improves performance slightly and allows temporary objects to be used for memory management within an expression, without fear of the objects being freed prematurely.
ja: これにより、パフォーマンスが若干向上し、オブジェクトが早期に解放される心配がなく、式内のメモリ管理に一時的なオブジェクトを使用することができます。

source: This includes local, global, static, if, else, loop, for, while, until, break, continue, goto, return, switch, case, try, catch, finally and throw.
ja: これは、local、global、static、if、else、loop、for、while、until、break、continue、goto、return、switch、case、try、catch、finally および throw を含んでいます。

source: This includes adding or removing end keys, suppressing or not suppressing specific keys, or ignoring the text produced by specific keys.
ja: これには、エンドキーの追加や削除、特定のキーの抑制や非抑制、特定のキーによって生成されるテキストの無視などが含まれます。

source: This includes all properties and methods which lack the static keyword.
ja: これには、staticキーワードを持たないすべてのプロパティとメソッドが含まれる。

source: This includes all properties and methods with the static keyword, and all nested classes.
ja: これには、staticキーワードを持つすべてのプロパティとメソッド、およびすべてのネストされたクラスが含まれます。

source: This includes all variables which the script contains non-dynamic references to, even if they have not been assigned values.
ja: これには、スクリプトが非動的な参照を含むすべての変数が含まれ、たとえ値が割り当てられていない場合でも、その変数が含まれます。

source: This includes internal calls made by built-in functions such as SetTimer and Hotkey.
ja: これには、SetTimerや Hotkeyなどの組込関数による内部呼び出しも含まれる。

source: This includes objects derived from Object, prototype objects such as 0.base, and COM objects, but not numbers or strings.
ja: Objectから派生したオブジェクト、0.baseなどのプロトタイプオブジェクト、COMオブジェクトも含まれますが、数値や文字列は含まれません。

source: This includes only the parameters between () or [], so may be empty.
ja: これは、()または[]の間のパラメータのみを含むので、空でも差し支えありません。

source: This includes primitive values, as in x is Integer (which is strictly a type check, whereas IsInteger(x) checks for potential conversion).
ja: xがIntegerのようなプリミティブな値も含まれます。（IsInteger(x)が変換の可能性をチェックするのに対し、これは厳密には型チェックです）

source: This includes:
ja: 包含：

source: This includes: Break, Case, Catch, Continue, Else, Finally, For, Global, Goto, If, Local, Loop, Return, Static, Switch, Throw, Try, Until, While
ja: 包含：Break、Case、Catch、Continue、Else、Finally、For、Global、Goto、If、Local、Loop、Return、Static、Switch、Throw、Try、Until、While

source: This indicates a keyboard shortcut that the user may press instead of selecting the menu item.
ja: これは、ユーザーがメニュー項目を選択する代わりに押すことができるキーボードショートカットを示しています。

source: This information has been tested with Winamp 2.78c but should work for other major releases as well.
ja: この情報はWinamp 2.78cでテストされていますが、他のメジャーリリースでも動作するはずです。

source: This inheritance is dynamic, so if thing.foo is modified, the change will be reflected by other.foo.
ja: この継承は動的なので、thing.fooが変更されると、その変更はother.fooに反映される。

source: This installer and related scripts are designed to permit multiple versions of AutoHotkey to coexist.
ja: このインストーラと関連スクリプトは、複数のバージョンのAutoHotkeyが共存できるように設計されています。

source: This integer is normally omitted, in which case the monitor function is limited to one thread at a time.
ja: この整数は通常省略され、その場合、モニター機能は一度に1スレッドに制限されます。

source: This interprets CharUpper's return value as a pure address that will get passed as an integer to CharLower.
ja: これは、CharUpperの戻り値を、CharLowerに整数として渡される純粋なアドレスと解釈します。

source: This is a boon, for instance, when moving a GUI window between a large external screen with 100 % DPI and a smaller screen with 200 % DPI.
ja: これは、たとえば、GUIウィンドウを100 %のDPIを持つ大きな外部スクリーンと200 %のDPIを持つ小さなスクリーンの間で移動させるときに便利です。

source: This is a critical error.
ja: これは致命的なエラーです。

source: This is a general technique not specific to OnEvent, so is generally ignored by the rest of this documentation.
ja: これはOnEventに特化したものではなく、一般的なテクニックなので、このドキュメントの他の部分では通常無視されます。

source: This is a multipurpose method that adds a menu item, updates one with a new submenu or callback, or converts one from a normal item into a submenu (or vice versa).
ja: メニューの追加、新しいサブメニューやコールバックによる更新、通常のメニューからサブメニューへの変換（またはその逆）など、多目的に使えるメソッドです。

source: This is a result of improved support for binary zero in strings.
ja: これは、文字列の2進数ゼロのサポートが改善された結果です。

source: This is a working example script that uses a timer to change the names of the buttons in a message box.
ja: これは、タイマーを使ってメッセージ・ボックスのボタンの名前を変更するスクリプトの例です。

source: This is achieved by automatically creating a method named __Init containing a call to super.__Init() and inserting each declaration into it.
ja: これは、super.__Init()への呼び出しを含む__Initという名前のメソッドを自動的に作成し、そこに各宣言を挿入することで実現される。

source: This is achieved by having the caller pass in a reference to a variable (usually empty) in which the function stores a value.
ja: これは、呼び出し元が、関数が値を格納する変数（通常は空）への参照を渡すことで実現されます。

source: This is achieved by launching a new thread (via hotkey, timed subroutine, custom menu item, etc.) while a prior thread already has a dialog displayed.
ja: これは、前のスレッドがすでにダイアログを表示している間に、新しいスレッドを（ホットキー、時限サブルーチン、カスタムメニュー項目などを介して）起動することで達成される。

source: This is achieved by preprocessing, so is not part of the language as such.
ja: これは前処理によって実現されるものであり、言語の一部ではありません。

source: This is also included as part of Resize below.
ja: これは、下記のResizeの一部としても含まれています。

source: This is always a single Unicode character, but for practical reasons, Unicode supplementary characters (where Number is in the range 0x10000 to 0x10FFFF) are counted as two characters.
ja: これは常にUnicodeの1文字ですが、実用上の理由から、Unicodeの補助文字（Numberが0x10000から0x10FFFFの範囲）は2文字としてカウントされることになります。

source: This is because Exit will not terminate a persistent script; it terminates only the current thread.
ja: これは、Exitが永続的なスクリプトを終了させず、現在のスレッドのみを終了させるからです。

source: This is because ^A presses Ctrl+Shift+A and ^a presses Ctrl+A.
ja: これは^AがCtrl+Shift+Aを、^aがCtrl+Aを押すからである。

source: This is because !A presses Alt+Shift+A and !a presses Alt+A.
ja: これは!AがAlt+Shift+Aを押し、!aがAlt+Aを押すからである。

source: This is because Function will be able to change global settings such as A_LastError and the last-found window for whichever thread happens to be running at the time it is called.
ja: これは、Functionが呼び出された時にたまたま実行されていたスレッドのA_LastErrorや last-found windowなどのグローバル設定を変更することができるようになるためです。

source: This is because Send serves multiple purposes, whereas hotkeys are optimized for key combinations.
ja: これは、Sendが複数の目的を果たすのに対し、ホットキーはキーの組み合わせに最適化されているためです。

source: This is because a same-volume move is similar to a rename, and therefore much faster.
ja: これは、同量移動はリネームと似ているため、より高速に処理できるためです。

source: This is because hotstring recognition works by collecting input from all levels except level 0 into a single global buffer.
ja: これは、ホットストリング認識が、レベル0を除くすべてのレベルからの入力を単一のグローバルバッファに集めることで機能するためです。

source: This is because it might prevent capitalization and modifier keys such as Ctrl from working properly.
ja: 大文字やCtrlなどの修飾キーが正しく機能しなくなる可能性があるためです。

source: This is because many web servers send an error page instead of the missing file.
ja: これは、多くのウェブサーバーが、見つからないファイルの代わりにエラーページを送信するためです。

source: This is because most applications are not designed to expect certain types of messages from external sources.
ja: これは、ほとんどのアプリケーションが、外部ソースからのある種のメッセージを期待するように設計されていないためです。

source: This is because multiple automatic resizings can be avoided when you have some idea of what the string's final length will be.
ja: これは、文字列の最終的な長さがある程度わかっていれば、何度も自動的にリサイズすることを避けられるからである。

source: This is because performance would be worse and also because the OS limits environment variables to 32 KB.
ja: これは、パフォーマンスが悪くなることと、OSが環境変数を32KBに制限しているためです。

source: This is because press-duration does not apply to down-only or up-only events such as {b down} and {b up}.
ja: これは、{b down}や {b up}のような下方向のみ、上方向のみのイベントには、プレス・デュレーションが適用されないからである。

source: This is because reliably using or deleting an icon/cursor/bitmap handle requires knowing which type it is.
ja: これは、アイコン/カーソル/ビットマップハンドルを確実に使用または削除するためには、それがどのタイプであるかを知る必要があるためです。

source: This is because some applications do not respond properly to the WM_GETTEXTLENGTH message, which causes AutoHotkey to make the return value too small to fit all the text.
ja: これは、アプリケーションによっては、WM_GETTEXTLENGTHメッセージに正しく応答しないため、AutoHotkeyが戻り値を小さくしすぎて、すべてのテキストを収めることができないためです。

source: This is because the expression +123 produces 123 (without a prefix) and ^123 is a syntax error.
ja: という表現があるからです。 +123は123（接頭辞なし）を生成し、^123はシンタックスエラーとなります。

source: This is because the OS gives each needy process a slice of CPU time (typically 20 milliseconds) before giving another timeslice to the script.
ja: これは、OSがスクリプトに別のタイムスライスを与える前に、各必要なプロセスにCPU時間のスライス（通常20ミリ秒）を与えるためである。

source: This is because the Text mode typically does not depend on the state of CapsLock and cannot trigger the system Win+L hotkey.
ja: これは、テキストモードが通常CapsLockの状態に依存せず、システムのWin+Lホットキーをトリガーすることができないためです。

source: This is because the body of each function or class definition is skipped whenever it is encountered during execution.
ja: これは、各関数やクラス定義の本体が、実行中に遭遇するたびにスキップされるからです。

source: This is because the chance of success is low and it may cause unwanted side-effects that are difficult to undo:
ja: 成功する確率が低く、元に戻すのが困難な望まない副作用を引き起こす可能性があるからです：

source: This is because the clipboard is never opened by this function, and thus it performs better and avoids any chance of interfering with another application that may be using the clipboard.
ja: これは、この関数によってクリップボードが開かれることがないため、パフォーマンスが向上し、クリップボードを使用している可能性のある他のアプリケーションと干渉する可能性が回避されるためです。

source: This is because the hook can keep track of which modifier keys (Alt/Ctrl/Win/Shift) the user is physically holding down and doesn't need to use the timeout.
ja: これは、フックがユーザーが物理的に押している修飾キー(Alt/Ctrl/Win/Shift)を追跡できるため、タイムアウトを使用する必要がないためです。

source: This is because the hook can keep track of which modifier keys (Alt, Ctrl, Shift, and Win) the user is physically holding down and doesn't need to use the timeout.
ja: これは、フックがユーザーが物理的に押している修飾キー（Alt、Ctrl、Shift、Win）を追跡できるため、タイムアウトを使用する必要がないためです。

source: This is because the left side of the AND would be false, and thus its right side would be incapable of making the final outcome true.
ja: これは、ANDの左辺がfalseであるため、その右辺は最終的な結果をtrueにすることができないからです。

source: This is because the left side would then be enough to determine the final answer with certainty:
ja: そうすると、左辺だけで最終的な答えが確実に決まるからです：

source: This is because the program maintains a collection of sorting preferences for each column, which would then get out of sync.
ja: これは、プログラムが各カラムのソート環境設定のコレクションを保持するためで、そうすると同期が取れなくなります。

source: This is because the same ID number is used to reference both the large and small versions of a particular icon.
ja: これは、あるアイコンの大きいバージョンと小さいバージョンの両方を参照するために、同じID番号が使用されるためです。

source: This is because the slow mode can be extremely slow if there are any application windows that are busy or "not responding".
ja: これは、ビジー状態や「応答なし」のアプリケーション・ウィンドウがあると、スロー・モードが極端に遅くなることがあるからだ。

source: This is because the visible frame is not actually part of the window, but rendered by a separate system process known as the "desktop window manager".
ja: これは、可視フレームが実際にはウィンドウの一部ではなく、「デスクトップウィンドウマネージャー」として知られる別のシステムプロセスによってレンダリングされるためである。

source: This is because they would be compared as numbers; for example, 20040201 is always numerically less (but chronologically greater) than 200401010533.
ja: これは、数字として比較されるからです。例えば、20040201は常に200401010533より数字的には小さい（しかし時系列的には大きい）のです。

source: This is because those methods postpone the user's physical pressing and releasing of keys until after the Send completes.
ja: これは、ユーザーがキーを押したり離したりする操作を、送信完了後まで延期するためです。

source: This is because unlike BlockInput, SendInput/Play does not discard what the user types during the send; instead, such keystrokes are buffered and sent afterward.
ja: これは、BlockInputとは異なり、SendInput/Playは送信中にユーザーが入力したものを破棄せず、そのようなキー入力をバッファリングして後から送信するためです。

source: This is because unlike BlockInput, those modes do not discard what the user types during the send; instead, those keystrokes are buffered and sent afterward.
ja: これは、BlockInputとは異なり、これらのモードでは送信中にユーザーが入力したものを破棄せず、代わりにそれらのキーストロークをバッファリングして後に送信するためです。

source: This is blank if the user would have been prompted or no compatible interpreters were found.
ja: ユーザーにプロンプトが表示されるか、互換性のあるインタープリターが見つからなかった場合は空白になる。

source: This is called a block.
ja: これはブロックと呼ばれるものです。

source: This is common for software from open source developers and Independent Software Vendors (ISV), especially soon after the release of each new version.
ja: これは、オープンソース開発者や独立系ソフトウェアベンダー（ISV）のソフトウェアによく見られる現象で、特に新バージョンがリリースされた直後にはよく見られます。

source: This is consistent with math operators, so 9223372036854775807+1 == 9223372036854775808 (but both produce -9223372036854775808).
ja: これは数学の演算子と一致しているので、9223372036854775807+1 == 9223372036854775808（ただしどちらも-9223372036854775808が出ます）。

source: This is demonstrated in the archived forums.
ja: これはアーカイブされたフォーラムで実証されている。

source: This is demonstrated in the GUI ToolTip example.
ja: これは、GUI ToolTipの例で実証されています。

source: This is described on the remapping page.
ja: これについては、リマッピングのページで説明しています。

source: This is determined by calling GetLastActivePopup.
ja: これは、GetLastActivePopupを呼び出すことで決定されます。

source: This is different than A_LoopFilePath in the following ways:
ja: A_LoopFilePathとは、以下の点で異なります：

source: This is different than A_LoopFilePath in the following ways: 1) It always contains the absolute/complete path of the file even if FilePattern contains a relative path; 2) Any short (8.3) folder names in FilePattern itself are converted to their long names; 3) Characters in FilePattern are converted to uppercase or lowercase to match the case stored in the file system.
ja: A_LoopFilePathとは、以下の点で異なります：1)FilePatternに相対パスが含まれていても、常にファイルの絶対パス/完全パスを含む。 2)FilePattern自体に含まれる短い（8.3）フォルダ名は、その長い名前に変換される。 3)FilePattern内の文字は、ファイルシステムに保存されているケースに合わせて大文字または小文字に変換される。

source: This is done because the presence of an external hook disables all of SendInput's advantages, making it inferior to both SendPlay and SendEvent.
ja: これは、外部フックの存在によってSendInputの利点がすべて無効になり、SendPlayとSendEventの両方に劣ることになるためである。

source: This is done by calling the appropriate Win function, specifying the window by title or some other criteria:
ja: これは、適切なWin関数を呼び出して、タイトルやその他の基準でウィンドウを指定することで行われます：

source: This is done by inverting the color of the window's title bar and/or taskbar button (if it has one).
ja: これは、ウィンドウのタイトルバーやタスクバーボタン（ある場合）の色を反転させることによって行われます。

source: This is done by preceding the asterisk with the absolute path of the uppermost folder followed by exactly one space or tab.
ja: アスタリスクの前に、最上位のフォルダの絶対パスを置き、その後にスペースまたはタブを正確に1つ置くことで、これを行うことができます。

source: This is done by registering an OnKeyDown function and using KeyOpt or NotifyNonText to specify which keys are of interest.
ja: OnKeyDown関数を登録し、KeyOptまたはNotifyNonTextを使用して、どのキーが注目されるかを指定することで実現します。

source: This is done by using GuiCtrl.Opt("-Redraw") before adding the items and GuiCtrl.Opt("+Redraw") afterward.
ja: これは、項目を追加する前にGuiCtrl.Opt("-Redraw")、追加後にGuiCtrl.Opt("+Redraw")を使用することで実現しています。

source: This is done simply by writing the pieces of the name and percent-enclosed variables in sequence, without any spaces.
ja: これは、名前とパーセントで囲まれた変数の断片を、空白を入れずに順番に書いていくだけです。

source: This is done to improve the reliability of scripts because a control sometimes needs a period of "rest" after being changed by one of these functions, so that the control has a chance to update itself and respond to the next function that the script may attempt to send to it.
ja: これは、スクリプトの信頼性を向上させるために行われます。なぜなら、コントロールが関数によって変更させられた後、コントロールがそれ自体を更新したり、次の関数に応答したりするための時間が必要だからです。

source: This is done to improve the reliability of scripts because a control sometimes needs a period of "rest" after being changed by one of these functions.
ja: これは、これらの機能によってコントロールが変更された後、一定期間「休息」する必要があるため、スクリプトの信頼性を向上させるために行われるものです。
